Add Jenkins stage view screenshot to README
